- The marketing team of xyz company launched an email campaign. This site has email addresses from all the users who created an account in the past.

- They want to know which types of users we have in our databases so that they can target their effective users based upon certain sanrio.

In [1]:
import pandas as pd

In [2]:
df=pd.read_excel(r"C:\Users\pagad\Downloads\Email Marketing Analysis.xlsx")
df.head(5)

,Column1,Type,Status,City,State,PostalCode,GenderCode,BirthDate,MaritalStatus,Enrolled on,Living status
0,00005DCC-4E51-41A5-91C5-6635B24C7D17,Business,InActive,NaN,NaN,500024.0,MALE,2018-08-12 17:07:12.430,U,2018-08-12 17:07:12.430,couple with children
1,0001F49E-9FE7-11e8-9E9C-00505682069A,Individual,Active,Valsad,GUJARAT,396001.0,MALE,1992-11-02 00:00:00.000,M,2018-08-14 18:02:46.000,couple with children
2,0001F4A2-9FE7-11e8-9E9C-00505682069A,Individual,Active,Secunderabad,TELANGANA,500011.0,FEMALE,1988-11-25 00:00:00.000,M,2018-08-14 18:05:23.000,couple with children
3,0001F4CD-9FE7-11e8-9E9C-00505682069A,Individual,Active,Nalgonda,TELANGANA,508101.0,MALE,1983-06-13 00:00:00.000,M,2018-08-14 18:37:33.000,couple with children
4,0001F4DE-9FE7-11e8-9E9C-00505682069A,Individual,Active,Hyderabad,TELANGANA,500028.0,MALE,1975-07-13 00:00:00.000,M,2018-08-14 18:47:00.000,couple with children

In [3]:
df.shape

(10000, 11)

In [4]:
df.isnull().sum()

Column1            0
Type               0
Status             0
City              73
State            126
PostalCode         1
GenderCode         0
BirthDate          0
MaritalStatus      0
Enrolled on        0
Living status      0
dtype: int64

In [5]:
df.columns

Index(['Column1', 'Type', 'Status', 'City', 'State', 'PostalCode',
       'GenderCode', 'BirthDate', 'MaritalStatus', 'Enrolled on ',
       'Living status'],
      dtype='object')

In [6]:
df['Type'].value_counts()

Individual    9736
Business       264
Name: Type, dtype: int64

In [7]:
df['City'].value_counts()

Hyderabad         2639
Secunderabad      2093
Mumbai            1498
Hyderabad City     976
Thane              227
                  ...
Baramati             1
Dimapur              1
Ajmer                1
Faridkot             1
Hindupur             1
Name: City, Length: 388, dtype: int64

- Unneccesary Columns
    - Columns
    * PostalCode
    * Birthday

- Extract features our Enrolled on column
   - Date & Time